<a href="https://colab.research.google.com/github/luisriego/Analise-de-dados-com-Python-e-Pandas/blob/main/excel_init.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [4]:
# Leitura de arquivos excel
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [5]:
# Concatenar os arquivos excel
df = pd.concat([df1,df2,df3,df4,df5])

In [6]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
df.sample(7)

       Cidade       Data  Vendas  LojaID  Qtde
189     Natal 2019-01-02  139.73    1037     2
103    Recife 2019-01-01   41.65     982     3
90      Natal 2019-01-02  100.54    1036     2
133  Salvador 2019-03-02  153.71    1035     1
148     Natal 2019-01-02   40.59    1037     3
216  Salvador 2019-01-02    5.82    1035     1
78   Salvador 2019-01-01  111.20    1036     3

In [9]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
# Alterar tipo de dado
df["LojaID"] = df["LojaID"].astype(object)

In [11]:
# Obter os tipos das colunas
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
# Criar a coluna Receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [14]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [15]:
# Obter a maior receita
df["Receita"].max()

3544.0

In [16]:
# Obter a menor receita
df["Receita"].min()

3.34

In [17]:
# Obter as maiores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [18]:
# Obter as menores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [19]:
# Obter a receita por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [21]:
# Obter os valores maiores da receita de maior a menor
df.sort_values("Receita",ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
38  Natal 2018-02-25   828.0    852     4   3312.0
10  Natal 2018-10-27   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0

In [22]:
# Converter datetime a int64 para testes
df["Data"] = df["Data"].astype("int64")

In [23]:
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID      object
Qtde         int64
Receita    float64
dtype: object

In [24]:
# Converter data em formato int64 a datetime
df["Data"] = pd.to_datetime(df["Data"])

In [26]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
dtype: object

In [27]:
# Obter a receita por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [29]:
# Criar a coluna ano
df["Ano_Venda"] = df["Data"].dt.year

In [30]:
df.sample(5)

       Cidade       Data  Vendas LojaID  Qtde  Receita  Ano_Venda
64   Salvador 2019-01-01   37.96   1037     3   113.88       2019
71      Natal 2019-03-20  840.00    854     3  2520.00       2019
57      Natal 2019-02-24  425.00    854     4  1700.00       2019
143     Natal 2019-01-02   41.18   1037     2    82.36       2019
147     Natal 2019-01-02   34.50   1035     1    34.50       2019

In [31]:
# Criar coluna mes e dia
df["Mes_Venda"], df["Dia_Venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [43]:
df.sample(5)

        Cidade       Data  Vendas  ... Ano_Venda  Mes_Venda  Dia_Venda
74   Fortaleza 2019-01-01  163.09  ...      2019          1          1
14       Natal 2018-06-03  660.00  ...      2018          6          3
149   Salvador 2019-01-02   22.38  ...      2019          1          2
131     Recife 2019-03-02  139.07  ...      2019          3          2
164      Natal 2019-01-02    6.59  ...      2019          1          2

[5 rows x 9 columns]

In [44]:
# Obter a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [45]:
# Calcular a diferencia de dias
df["Diferenca_dias"] = df["Data"] - df["Data"].min()

In [54]:
df.sample(5)

        Cidade       Data  Vendas  ... Mes_Venda  Dia_Venda  Diferenca_dias
122  Fortaleza 2019-03-02  235.06  ...         3          2        425 days
102      Natal 2019-01-02   40.84  ...         1          2        366 days
14   Fortaleza 2019-01-12  132.68  ...         1         12        376 days
126    Aracaju 2018-01-01   13.41  ...         1          1          0 days
57     Aracaju 2018-01-01   23.49  ...         1          1          0 days

[5 rows x 10 columns]

In [56]:
#Obter tambem o trimestre da venda
df["Trimestre_venda"] = df["Data"].dt.quarter

In [57]:
df.sample(5)

       Cidade       Data  Vendas  ... Dia_Venda  Diferenca_dias  Trimestre_venda
211  Salvador 2019-01-02  141.05  ...         2        366 days                1
124    Recife 2019-03-02   47.98  ...         2        425 days                1
41   Salvador 2019-02-13    9.86  ...        13        408 days                1
52      Natal 2018-04-27  778.00  ...        27        116 days                2
16      Natal 2018-07-01  298.00  ...         1        181 days                3

[5 rows x 11 columns]

In [61]:
# Filtrado de vendas por ano e mes
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [63]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... Dia_Venda  Diferenca_dias  Trimestre_venda
18       Natal 2019-03-14  581.00  ...        14        437 days                1
32       Natal 2019-03-17  244.00  ...        17        440 days                1
139   Salvador 2019-03-02  169.01  ...         2        425 days                1
115   Salvador 2019-03-02  202.33  ...         2        425 days                1
122  Fortaleza 2019-03-02  235.06  ...         2        425 days                1
117  Fortaleza 2019-03-02   15.42  ...         2        425 days                1
120  Fortaleza 2019-03-02  184.90  ...         2        425 days                1
122   Salvador 2019-03-02   13.27  ...         2        425 days                1
132   Salvador 2019-03-02   19.61  ...         2        425 days                1
137   Salvador 2019-03-02   51.66  ...         2        425 days                1
82       Natal 2019-03-07  868.00  ...         7        430 days                1
118  Fortaleza 2019-03-02   17.70  ...         2        425 days                1
122     Recife 2019-03-02  235.06  ...         2        425 days                1
113   Salvador 2019-03-02   18.90  ...         2        425 days                1
126     Recife 2019-03-02   41.87  ...         2        425 days                1
108   Salvador 2019-03-02   11.72  ...         2        425 days                1
108  Fortaleza 2019-03-02  152.89  ...         2        425 days                1
127  Fortaleza 2019-03-02   39.56  ...         2        425 days                1
137     Recife 2019-03-02   51.99  ...         2        425 days                1
121  Fortaleza 2019-03-02   41.55  ...         2        425 days                1

[20 rows x 11 columns]